In [1]:
try:
    file = open("info.csv","x")
    file.close()
except:
    print('The file is already there')

In [3]:
import pandas as pd
try:
    df = pd.read_csv("info.csv")
    print(df)
except Exception as e:
    print(f"Error: {e}")

   sn     name  age  add        phone
0   1      Ram   18  ktm  98784830200
1   2     Hari   24  bkt   9837475728
2   3     Pari   23  llt   9843774374
3   4     Maya   34  ktm   9847547373
4   5    Salar   45  llt    985434324
5   6  Prabhas   70  hbd      9173829

In [4]:
import pandas as pd
try:
    df = pd.read_csv("info.csv", nrows = 4, index_col = 'sn')
    print(df)
except Exception as e:
    print(f"Error: {e}")

    name  age  add        phone
sn
1    Ram   18  ktm  98784830200
2   Hari   24  bkt   9837475728
3   Pari   23  llt   9843774374
4   Maya   34  ktm   9847547373

In [6]:
import pandas as pd
try:
    df = pd.read_csv("info.csv", nrows = 4, index_col = 'sn')
    print(df.head(2))
except Exception as e:
    print(f"Error: {e}")

    name  age  add        phone
sn
1    Ram   18  ktm  98784830200
2   Hari   24  bkt   9837475728

In [7]:

import pandas as pd
try:
    df = pd.read_csv("info.csv", nrows = 4, index_col = 'sn')
    print(df.tail(2))
except Exception as e:
    print(f"Error: {e}")

    name  age  add       phone
sn
3   Pari   23  llt  9843774374
4   Maya   34  ktm  9847547373

In [15]:

df = pd.read_csv("info.csv", index_col = 'sn', usecols = ['sn','name','phone'])
print(df.tail(2))

       name      phone
sn
5     Salar  985434324
6   Prabhas    9173829

In [24]:
df = pd.read_csv("info.csv", index_col = 'sn')
df[['name','phone','age']]

       name        phone  age
sn
1       Ram  98784830200   18
2      Hari   9837475728   24
3      Pari   9843774374   23
4      Maya   9847547373   34
5     Salar    985434324   45
6   Prabhas      9173829   70

In [26]:
df.iloc[1:3]

    name  age  add       phone
sn
2   Hari   24  bkt  9837475728
3   Pari   23  llt  9843774374

In [27]:
df.loc[2:4]

    name  age  add       phone
sn
2   Hari   24  bkt  9837475728
3   Pari   23  llt  9843774374
4   Maya   34  ktm  9847547373

In [28]:
df['name']

sn
1        Ram
2       Hari
3       Pari
4       Maya
5      Salar
6    Prabhas
Name: name, dtype: object

In [29]:
df[df['name'] == 'Ram']

   name  age  add        phone
sn
1   Ram   18  ktm  98784830200

In [30]:
df[df['age']>=25]

       name  age  add       phone
sn
4      Maya   34  ktm  9847547373
5     Salar   45  llt   985434324
6   Prabhas   70  hbd     9173829

In [6]:
df = pd.read_csv("info.csv", nrows = 4, index_col = 'sn')
df2 = df[(df['age']>=25) & (df['add']== 'ktm')] 
df2

    name  age  add       phone
sn
4   Maya   34  ktm  9847547373

In [3]:
import pandas as pd
info = {'Name':['Ram','Shyam','Hari'],
       'Age':[34,35,36],
       'Address':['Kathmandu','Bhaktapur','Lalitpur']}
df1 = pd.DataFrame(info)
df1

    Name  Age    Address
0    Ram   34  Kathmandu
1  Shyam   35  Bhaktapur
2   Hari   36   Lalitpur